let text = { А: 'А', a: 'a', Б:'B', б: 'b', В: 'V', в: 'v', Г:'G', г: 'g', Д:'D', д: 'd', Е: 'E', е: 'e', Ё: 'YO', ё: 'yo', Ж: 'ZH', ж: 'zh',
             З: 'Z', з: 'z', И: 'I', и: 'i', Й: 'J', й: 'j', К: 'K', к: 'k', Л: 'L', л: 'l', М: 'M', м: 'm', Н: 'N', н: 'n', О: 'O', о: 'o',
             П: 'P', п: 'p', Р: 'R', р: 'r', С: 'S', с: 's', Т: 'T', т: 't', У: 'U', у: 'u', Ф: 'F', ф: 'f', Х: 'H', х: 'h', Ц: 'C',ц: 'c',
             Ч: 'CH', ч: 'ch', Ш: 'SH', ш: 'sh', Щ: 'SHH', щ: 'shh', ъ: '``', Ы: 'YI', ы: 'yi', ь: '`', Э: 'YE', э: 'ye', Ю: 'YU', ю: 'yu',
             Я: 'YA', я: 'ya'
            }; // объект: информация о нем

while (true) {
    let str = prompt("Введите строку");
    if (str != null) {
        let arr = str.split(''); // разделили посимвольно
        for (let i = 0; i < arr.length; i++) { //побежали по массиву
            if (text[arr[i]] != undefined) // undefined -  переменная неопределенная
                arr[i] = text[arr[i]];
        }
        alert(arr.join('')); //объединяем символы
    }
}



